<a href="https://colab.research.google.com/github/ruchi-sharma1/multivariate_Linear_regression/blob/main/multivariate_linear_regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
pip install word2number

Collecting word2number
  Downloading https://files.pythonhosted.org/packages/4a/29/a31940c848521f0725f0df6b25dca8917f13a2025b0e8fcbe5d0457e45e6/word2number-1.1.zip
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py) ... done
  Created wheel for word2number: filename=word2number-1.1-cp37-none-any.whl size=5584 sha256=7a09be1a2fc9d0fe41ffff17504c84a69753f507ab0f023bcfe948b3a9c25f29
  Stored in directory: /root/.cache/pip/wheels/46/2f/53/5f5c1d275492f2fce1cdab9a9bb12d49286dead829a4078e0e
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1

Import all required libraries

In [ ]:
import pandas as pd
import numpy as np
import sklearn

read csv file of data

In [ ]:
df= pd.read_csv('/content/drive/MyDrive/PROJECTS/hiring.csv')

Check the data

In [ ]:
df.head(10)

  Experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

convert text into coresponding numbers

In [ ]:
from word2number import w2n

In [ ]:
df.Experience=df.Experience.fillna("zero")

In [ ]:
df.Experience=df.Experience.apply(w2n.word_to_num)

In [ ]:
df

   Experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         NaN                7   72000
7          11         7.0                8   80000

In [ ]:
df.Experience.median()

4.0

In [ ]:
m=df.test_score.mean()

In [ ]:
df.test_score=df.test_score.fillna(m)

In [ ]:
df

   Experience  test_score  interview_score  salary
0           0    8.000000                9   50000
1           0    8.000000                6   45000
2           5    6.000000                7   60000
3           2   10.000000               10   65000
4           7    9.000000                6   70000
5           3    7.000000               10   62000
6          10    7.857143                7   72000
7          11    7.000000                8   80000

In [ ]:
from sklearn.linear_model import LinearRegression

In [ ]:
model = LinearRegression()
model.fit(df[['Experience','test_score', 'interview_score']], df['salary'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
model.predict([[2,10.00,10]])

array([63991.7318464])